import pytest
@pytest.fixture
def abnormal_data():
    return []
@pytest.fixture
def normal_data():
    return [
        {'Номер карты': '*8000', 'Статус': 'OK', 'Сумма операции': -160.89, 'Валюта операции': 'CNY'},
        {'Номер карты': '*9000', 'Статус': 'OK', 'Сумма операции': -160.89, 'Валюта операции': 'RUB'},
        {'Номер карты': 'nan', 'Статус': 'FAILED', 'Сумма операции': -160.89, 'Валюта операции': 'CNY'},
        {'Номер карты': 'nan', 'Статус': 'OK', 'Сумма операции': -160.89, 'Валюта операции': 'RUB'},
        {'Номер карты': '*9000', 'Статус': 'FAILED', 'Сумма операции': -160.89, 'Валюта операции': 'RUB'}
        ]